MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx534f064h.h
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF8861B0)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF8861B4)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF8861B8)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF8861BC)));
#define CNCON CNCON
extern volatile uint32_t   CNCON __attribute__((section("sfrs"), address(0xBF8861C0)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONbits_t;
extern volatile __CNCONbits_t CNCONbits __asm__ ("CNCON") __attribute__((section("sfrs"), address(0xBF8861C0)));
extern volatile uint32_t        CNCONCLR __attribute__((section("sfrs"),address(0xBF8861C4)));
extern volatile uint32_t        CNCONSET __attribute__((section("sfrs"),address(0xBF8861C8)));
extern volatile uint32_t        CNCONINV __attribute__((section("sfrs"),address(0xBF8861CC)));
#define CNEN CNEN
extern volatile uint32_t   CNEN __attribute__((section("sfrs"), address(0xBF8861D0)));
typedef union {
  struct {
    uint32_t CNEN0:1;
    uint32_t CNEN1:1;
    uint32_t CNEN2:1;
    uint32_t CNEN3:1;
    uint32_t CNEN4:1;
    uint32_t CNEN5:1;
    uint32_t CNEN6:1;
    uint32_t CNEN7:1;
    uint32_t CNEN8:1;
    uint32_t CNEN9:1;
    uint32_t CNEN10:1;
    uint32_t CNEN11:1;
    uint32_t CNEN12:1;
    uint32_t CNEN13:1;
    uint32_t CNEN14:1;
    uint32_t CNEN15:1;
    uint32_t CNEN16:1;
    uint32_t CNEN17:1;
    uint32_t CNEN18:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENbits_t;
extern volatile __CNENbits_t CNENbits __asm__ ("CNEN") __attribute__((section("sfrs"), address(0xBF8861D0)));
extern volatile uint32_t        CNENCLR __attribute__((section("sfrs"),address(0xBF8861D4)));
extern volatile uint32_t        CNENSET __attribute__((section("sfrs"),address(0xBF8861D8)));
extern volatile uint32_t        CNENINV __attribute__((section("sfrs"),address(0xBF8861DC)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF8861E0)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t CNPUE2:1;
    uint32_t CNPUE3:1;
    uint32_t CNPUE4:1;
    uint32_t CNPUE5:1;
    uint32_t CNPUE6:1;
    uint32_t CNPUE7:1;
    uint32_t CNPUE8:1;
    uint32_t CNPUE9:1;
    uint32_t CNPUE10:1;
    uint32_t CNPUE11:1;
    uint32_t CNPUE12:1;
    uint32_t CNPUE13:1;
    uint32_t CNPUE14:1;
    uint32_t CNPUE15:1;
    uint32_t CNPUE16:1;
    uint32_t CNPUE17:1;
    uint32_t CNPUE18:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF8861E0)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF8861E4)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF8861E8)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF8861EC)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF88B000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
extern volatile __C1CONbits_t C1CONbits __asm__ ("C1CON") __attribute__((section("sfrs"), address(0xBF88B000)));
extern volatile uint32_t        C1CONCLR __attribute__((section("sfrs"),address(0xBF88B004)));
extern volatile uint32_t        C1CONSET __attribute__((section("sfrs"),address(0xBF88B008)));
extern volatile uint32_t        C1CONINV __attribute__((section("sfrs"),address(0xBF88B00C)));
#define C1CFG C1CFG
extern volatile uint32_t   C1CFG __attribute__((section("sfrs"), address(0xBF88B010)));
typedef union {
  struct {
    uint32_t BRP:6;
    uint32_t SJW:2;
    uint32_t PRSEG:3;
    uint32_t SEG1PH:3;
    uint32_t SAM:1;
    uint32_t SEG2PHTS:1;
    uint32_t SEG2PH:3;
    uint32_t :3;
    uint32_t WAKFIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CFGbits_t;
extern volatile __C1CFGbits_t C1CFGbits __asm__ ("C1CFG") __attribute__((section("sfrs"), address(0xBF88B010)));
extern volatile uint32_t        C1CFGCLR __attribute__((section("sfrs"),address(0xBF88B014)));
extern volatile uint32_t        C1CFGSET __attribute__((section("sfrs"),address(0xBF88B018)));
extern volatile uint32_t        C1CFGINV __attribute__((section("sfrs"),address(0xBF88B01C)));
#define C1INT C1INT
extern volatile uint32_t   C1INT __attribute__((section("sfrs"), address(0xBF88B020)));
typedef union {
  struct {
    uint32_t TBIF:1;
    uint32_t RBIF:1;
    uint32_t CTMRIF:1;
    uint32_t MODIF:1;
    uint32_t :7;
    uint32_t RBOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVRIF:1;
    uint32_t TBIE:1;
    uint32_t RBIE:1;
    uint32_t CTMRIE:1;
    uint32_t MODIE:1;
    uint32_t :7;
    uint32_t RBOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVRIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1INTbits_t;
extern volatile __C1INTbits_t C1INTbits __asm__ ("C1INT") __attribute__((section("sfrs"), address(0xBF88B020)));
extern volatile uint32_t        C1INTCLR __attribute__((section("sfrs"),address(0xBF88B024)));
extern volatile uint32_t        C1INTSET __attribute__((section("sfrs"),address(0xBF88B028)));
extern volatile uint32_t        C1INTINV __attribute__((section("sfrs"),address(0xBF88B02C)));
#define C1VEC C1VEC
extern volatile uint32_t   C1VEC __attribute__((section("sfrs"), address(0xBF88B030)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1VECbits_t;
extern volatile __C1VECbits_t C1VECbits __asm__ ("C1VEC") __attribute__((section("sfrs"), address(0xBF88B030)));
extern volatile uint32_t        C1VECCLR __attribute__((section("sfrs"),address(0xBF88B034)));
extern volatile uint32_t        C1VECSET __attribute__((section("sfrs"),address(0xBF88B038)));
extern volatile uint32_t        C1VECINV __attribute__((section("sfrs"),address(0xBF88B03C)));
#define C1TREC C1TREC
extern volatile uint32_t   C1TREC __attribute__((section("sfrs"), address(0xBF88B040)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1TRECbits_t;
extern volatile __C1TRECbits_t C1TRECbits __asm__ ("C1TREC") __attribute__((section("sfrs"), address(0xBF88B040)));
extern volatile uint32_t        C1TRECCLR __attribute__((section("sfrs"),address(0xBF88B044)));
extern volatile uint32_t        C1TRECSET __attribute__((section("sfrs"),address(0xBF88B048)));
extern volatile uint32_t        C1TRECINV __attribute__((section("sfrs"),address(0xBF88B04C)));
#define C1FSTAT C1FSTAT
extern volatile uint32_t   C1FSTAT __attribute__((section("sfrs"), address(0xBF88B050)));
typedef union {
  struct {
    uint32_t FIFOIP:32;
  };
  struct {
    uint32_t FIFOIP0:1;
    uint32_t FIFOIP1:1;
    uint32_t FIFOIP2:1;
    uint32_t FIFOIP3:1;
    uint32_t FIFOIP4:1;
    uint32_t FIFOIP5:1;
    uint32_t FIFOIP6:1;
    uint32_t FIFOIP7:1;
    uint32_t FIFOIP8:1;
    uint32_t FIFOIP9:1;
    uint32_t FIFOIP10:1;
    uint32_t FIFOIP11:1;
    uint32_t FIFOIP12:1;
    uint32_t FIFOIP13:1;
    uint32_t FIFOIP14:1;
    uint32_t FIFOIP15:1;
    uint32_t FIFOIP16:1;
    uint32_t FIFOIP17:1;
    uint32_t FIFOIP18:1;
    uint32_t FIFOIP19:1;
    uint32_t FIFOIP20:1;
    uint32_t FIFOIP21:1;
    uint32_t FIFOIP22:1;
    uint32_t FIFOIP23:1;
    uint32_t FIFOIP24:1;
    uint32_t FIFOIP25:1;
    uint32_t FIFOIP26:1;
    uint32_t FIFOIP27:1;
    uint32_t FIFOIP28:1;
    uint32_t FIFOIP29:1;
    uint32_t FIFOIP30:1;
    uint32_t FIFOIP31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FSTATbits_t;
extern volatile __C1FSTATbits_t C1FSTATbits __asm__ ("C1FSTAT") __attribute__((section("sfrs"), address(0xBF88B050)));
extern volatile uint32_t        C1FSTATCLR __attribute__((section("sfrs"),address(0xBF88B054)));
extern volatile uint32_t        C1FSTATSET __attribute__((section("sfrs"),address(0xBF88B058)));
extern volatile uint32_t        C1FSTATINV __attribute__((section("sfrs"),address(0xBF88B05C)));
#define C1RXOVF C1RXOVF
extern volatile uint32_t   C1RXOVF __attribute__((section("sfrs"), address(0xBF88B060)));
typedef union {
  struct {
    uint32_t RXOVF:32;
  };
  struct {
    uint32_t RXOVF0:1;
    uint32_t RXOVF1:1;
    uint32_t RXOVF2:1;
    uint32_t RXOVF3:1;
    uint32_t RXOVF4:1;
    uint32_t RXOVF5:1;
    uint32_t RXOVF6:1;
    uint32_t RXOVF7:1;
    uint32_t RXOVF8:1;
    uint32_t RXOVF9:1;
    uint32_t RXOVF10:1;
    uint32_t RXOVF11:1;
    uint32_t RXOVF12:1;
    uint32_t RXOVF13:1;
    uint32_t RXOVF14:1;
    uint32_t RXOVF15:1;
    uint32_t RXOVF16:1;
    uint32_t RXOVF17:1;
    uint32_t RXOVF18:1;
    uint32_t RXOVF19:1;
    uint32_t RXOVF20:1;
    uint32_t RXOVF21:1;
    uint32_t RXOVF22:1;
    uint32_t RXOVF23:1;
    uint32_t RXOVF24:1;
    uint32_t RXOVF25:1;
    uint32_t RXOVF26:1;
    uint32_t RXOVF27:1;
    uint32_t RXOVF28:1;
    uint32_t RXOVF29:1;
    uint32_t RXOVF30:1;
    uint32_t RXOVF31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXOVFbits_t;
